{
	"id": "blogEntry10",
    "date": "August, 08, 2016",
	"thumbnail": "img\/thumbnail\/Seclogo.jpg",
	"link": "https:\/\/www.airpair.com\/javascript\/posts\/the-legend-of-canvas",
	"linkText": "legend of Canvas",
	"text": "Completely and totally inspired by an article posted on Airpair. I finally mastered or at least got a hold of my coding habits. About three months ago I promised to myself that I would spend more time coding and less time playing video games…. Yes I’m talking about you starcraft.\n\nHowever it became a mountain of excuses. Especially when it comes to managing two jobs. One full-time and the other free-lance. My free-time became filled with, “I deserve a break,  I gotta take a breather from coding”. But this was a poisonous mindset, I had to make coding part of my life not ‘work’. Something that I could clearly eat up everyday and still not get tired as software is constantly updating I still have to keep myself relevant and up-to-date. That happened, today and I realised it only now. Here’s how it went down and the requirements that I needed to feel this way.\n“Live to Code… Not Code to Live”.\n\nThe biggest change was that I took some spare time to build same basic building block in my technical arsenal. This was probably the biggest of all the hurdles. There was alot of painful frustration as I learned the basic theories of my trade in order to be fully confident when faced with new tasks. Before this when an new idea came up in my head, fear would ensue in the sense that I could not come up with the basic ideas of how to implement the solution. Now, I still don’t. However, I have the confidence that I can build the basic structures required to take on any challenge.\n\nSecond, still take some breaks. Once a day I will play a few games. Especially now that I got my self hooked onto Heroes of the Storm. A much quicker and more fulfilling game than StarCraft. Human interaction is GREAT.\n\nThird, friends that you can actually show off your work to. Probably one of my most driving forces here is the ability to show of your work. Bragging does feel good. Of course limit your big head, but when you have done something awesome keeping it to yourself can make you feel quite lonely and depressed.\n\nFinally, the final trigger that got me into the mood of coding after hours was a dedicated environment. A place with no distractions, a place where it conditions you to say this is the place where I code and nothing else. Prior to this I would code in the living filled with noises that did not pertain to me and exhaust my mindset, also the noise also just made me want to play more games. Essentially everyone else was having fun while I looked like I was doing work. Now my setup is a ironing board(mind you its adjustable so it great for a stand up sitting table as well) with one external monitor(for twitch streams to keep me from being depressed) and a laptop the environment in which I code.\n\n\nWith this now I can finally start coding. Also one thing always make something you love… Hence I combined that with video games and hopefully great ideas will come soon..\n\nRegards to the void\n",
	"title": "Mastering of the extracurriculars"
}