{
  "text": "So it's been about two years since the last post made (minus the test post). A lot has occurred since then.I have been spending a lot more time with self-reflection and realized that competition although rewarding and challenging. Taken to an extreme has been very bad for my mental health. Competition to such an extreme has such large diminishing returns initially its great however as you go farther deeper in, the negatives start outwaying the positives. For coding, constantly coding and studying lead to burnout. For Gaming it lead to a significant wrist injury which still pains me today.Thus for this year, competition will no longer be a main focus but more of a tertiary item. Instead it will just be simplybe self-improvement. Pushing myself lead me to have massive burnout. Burnout that resulted in me doing nothing for a straight four months. It was only until I picked up my 3D origami hobby again where I took improvement at a slower, more enjoyable pace that I wanted to relearn again. Lesson for this year! It's not a sprint, it's a marathon... I life long one.\n<h4>Completed Projects</h4>Completed projects this year were done at the last quarter of the year. Rebounding from the burnout, I began applying the VUE code I learned from work in recreating my Angular 1.0 website in VUE. That was a fun experience, relooking at two year old code and remaking it. I've started a new youtube channel for displaying my 3D origami <a target=\"_blank\" href=\"https://www.youtube.com/channel/UCKTq9yNdW1a2wmElAeZ-PgA\">creations</a> here you can see some of the cool stuff made. Through talking with a few people I have become a moderator for a 3d origami <a target=\"_blank\" href=\"https://www.reddit.com/r/GoldenVentureFolding/\">subreddit</a>. Finally I started the process of losing weight this month, 5 pounds down already. A good start and hopefully lead to something more.\n<h4>Plans for Next Year</h4>Plans for next year, with the burnout recently doused with water(Can you douse a burnout with water?). I have two new projects plan related to 3d origami subreddit, I will be creating an <a target=\"_blank\" href=\"https://github.com/lantern77/3d-origami-diagram-tool\">editing tool</a> for creating 3d origami diagram. In addition, I will be learning React to expand my repertoire. I will be learning it to create a darkest dungeon tool to help make my game experience more enjoyable. The year has been through a large and slow down. But by the end it reached a very large and hopeful peak. I learned my limitations and what is needed to push me forward. Hopefully this is the start of brand new thing.\n\nRegards Peter.\nP.S I hopefully should write a tutorial for VUE and hopefully this goes through my CMS well!!!",
  "title": "A New Year",
  "thumbnail": "img/thumbnail/ZW45ylGvDU29aNp8qwaMRgZjgq5KFZHi6RzH4q3FQ7y8qV5pMbKbmlBOnRmxa665uANM=w300.png",
  "date": "January 1, 2019",
  "tags": "New, Year, Hope, Burnout",
  "id": "blogEntry13"
}