{"date":"May 18, 2015","thumbnail":"img\/thumbnail\/1204647105_Coffee_Break.jpg","link":"","linkText":"","text":"It’s Monday, May 18, 2015 … and here is how it happens….. DUM DUM  ~ music tune… beep bloop. blop. Cheesy intro end here. Man I wish I could write better introductions, but I much prefer my un - edited, grammatically incorrect, filled blog entries. It just seems more genuine and in the moment.\n\n\tThis time however, the main focus is on the 2014 -2015 summer and university school year much has happened. Let’s first get the lay down of the major events, I can think on the top of my head right now. \n\t\nI got my first ever software development job - although part time it was probably one of the biggest mind set changes.\nCame back to school and was assigned the role of vp external and head delegate for McMaster’s software engineering club.\nThe creation, more like participation of the McMaster’s new hack-a-thon group, HackitMac.\nThe job application process, pressure, much, much pressure. CUSEC preparation on a whole and the event itself. Much perspective. Finally landing the full 16 month coop.\n\n\tI would like to go in detail about each but that would drag on forever now that I think about it…..Yup I am not gonna edit that out or delete. I already spoke it….. But I can definitely expand on it a bit.\n\n\tMore than anything else this year has been one of the largest rollercoasters ever. From being straight on full job hunt mode to extracurriculars participation. I would definitely say that out of the years of my life this has been my most active. With every event related to actual software and programming I was there ready to learn. Ready to get new things in my head to prepare my self for the future. That was definitely one of the strong points of the year. In addition, with so much activity came the dawn of new friendships. By making the preparations for CUSEC for McMaster students, I made alot more friends. Especially with the Fourth years and graduate students. They also helped me and provided insight to what I should be looking out for very thoughtful...Wait… That was a bad way to end that sentence...meh… Oh wait also I forgot HackitMac, yo Jimmy Wang and Ocean Cheung best dudes ever, hard working and truly believe in what they were doing for our school . Executives on HackitMac, they truly showed me what it meant to be underdogs in the academic world. How when you do something you truly believe will be for the better for the school then it’s worth doing.. Especially when our school needs betterment….lol\n\n\tHowever, with every reflection comes the need to reflect on the weaknesses. There are two main stickers here. How to deal with massive amounts of pressure both from work and school and my health. Well the latter is much easier to explain, simple to say is that I got fatter…...like 20 pounds fatter….yup packing in the sweets helps…...Definitely one of the larger goals for this year is to lose this gawd damn awful weight. It seriously ruins my day feeling tired every second….MUR>>>>>> Second point however is the dealing with pressure, oh and learning to say no. Probably one of the stupidest thing I did was accepting to do all ten interviews within a span of five days. It made me ill-prepared and just not ready for any of them, completely unready and sleepless. I would like to name some of the things I bombed like writing a ruby function when I should have wrote a java function, forgetting how to use JQuery after studying it for two hours, and not being able to solve a bug simply because I was too scared to ask questions, when I couldn’t hear what someone said #phoneInterviews. Truly this year one of the skills I have to learn is handling pressure. Even during CUSEC preparation, I unfortunately messed up someone’s ticket. I forgot to sign them up  and unfortunately tickets were now sold out online. Fortunately, thank gawd everything worked out, however there were weeks where I could not sleep….OH my, I even forgot with all this work my grade started to tumble Luckily I was able to pull it back for an awesome transcript at the end, but man did I make people around me feel grumpy….\n\nLesson here, work-life balance…. Don’t drink all the cranberry juice all at once, it ain’t awesome. But it sure does taste good. Better than that prune juice…..Ye Ima end it there.\n\n\nMUR\n\t\n","title":"Reflection for 2014\/2015 year - thinking of success and failure"}